#7.1--------------------------------------------------------------------------------------------------------------------
nums = [10, 23, 45, 7, 89]
vvod = int(input("Введите любое число: "))

print(f"Исходный список: {nums}")
print(f"Введенное число: {vvod}")

if vvod in nums:
    print("Ого, вы угадали число!")
else:
    print("Такого числа нет")

#7.2--------------------------------------------------------------------------------------------------------------------
listn = [3, 6, 10, 6, 45]
dubl = [x for x in set(listn)
        if listn.count(x) > 1]

if dubl:
    print(f"Повторяющиеся элементы: {dubl}")
else:
    print(f"Повторяющихся элементов нет")

#7.3--------------------------------------------------------------------------------------------------------------------
days = ("Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье")
weekend = int(input("Сколько выходных вы хотите? \n"
                    "Введите количетво:  "))

work = 7 - weekend
if weekend > 0 or weekend <= 7:
    weekend = days[work:]
    workdays = days[:work]

print(f"Ваши выходные дни: {weekend}")
print(f"Ваши рабочие дни: {workdays}")

#7.4--------------------------------------------------------------------------------------------------------------------
gr1 = ["Смирнов", "Соколов", "Лебедев", "Кузнецов", "Васильев", "Попов", "Новиков", "Морозов", "Волков", "Воробьев"]
gr2 = ["Богданов", "Орлов", "Скворцов", "Соловьев", "Крылов", "Зайцев", "Виноградов", "Романов", "Петров", "Сергеев"]
team = (*gr1[:5], *gr2[:5])

print(f"Группа 1 - {gr1}")
print(f"Группа 2 - {gr2}")
print(f"Команда - {team}")

print(f"Длина команды - {len(team)}")
print(f"Сортировка - {tuple(sorted(team))}")
print(f"Лебедев находится в команде? \n"
      f"{"Да" if "Лебедев" in team else "Нет"}")
print(f"Сколько раз - {team.count("Лебедев")}")